{
  "backend/main.mo": "Motoko canister managing products and orders with CRUD-like queries and functions to add products, search/filter, and place orders while updating stock.",
  "feature_evidence.json": "Feature evidence report mapping implemented features to frontend files, components, and requirement IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file and component in the project.",
  "frontend/index.css": "Tailwind base/theme definitions using custom OKLCH palette with light and dark mode variables.",
  "frontend/index.html": "Basic HTML shell loading the React app root and main entry script.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes for catalog, cart, checkout, and confirmation, wrapped in CartProvider and AppLayout.",
  "frontend/src/components/catalog/CatalogFilters.tsx": "UI controls for searching products and filtering by category using input and select components.",
  "frontend/src/components/catalog/ProductCard.tsx": "Displays a product’s details, price, stock, and add‑to‑cart button inside a card UI component.",
  "frontend/src/components/layout/AppLayout.tsx": "High‑level layout wrapping all pages with a header, main content area, and footer.",
  "frontend/src/components/layout/Footer.tsx": "Footer showing copyright info and a Caffeine.ai attribution link.",
  "frontend/src/components/layout/Header.tsx": "Responsive header with logo, navigation, and a cart button displaying total cart items.",
  "frontend/src/context/CartContext.tsx": "React context managing cart state, persistence, and actions for adding, removing, and updating items.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on the current identity and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, stored identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines product fetching and order placement hooks using the actor and React Query.",
  "frontend/src/index.css": "Sets global Tailwind styles, color variables, dark mode overrides, and catalog page background utilities.",
  "frontend/src/lib/cartStorage.ts": "Handles saving, loading, and clearing the shopping cart in sessionStorage with bigint serialization support.",
  "frontend/src/main.tsx": "Bootstraps the app with ReactDOM, providing React Query and Internet Identity contexts.",
  "frontend/src/pages/CartPage.tsx": "Displays and manages cart items with quantity controls, removal, and navigation to browsing when empty.",
  "frontend/src/pages/CatalogPage.tsx": "Fetches and filters products by search and category, rendering product cards and loading/error states.",
  "frontend/src/pages/CheckoutPage.tsx": "Handles checkout form submission, order placement, and redirects when the cart is empty.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Displays order confirmation details by loading the last order from sessionStorage, formatting data, and clearing the cart.",
  "frontend/src/types/cart.ts": "Defines CartItem and CartState interfaces for cart data structure.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, typography, animations, and content paths with extended custom design tokens.",
  "project_state.json": "Describes the project's state, features, requirements, and branding assets for the Easy Provision Store app."
}